# Q1

In [10]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("galaxy_users.csv")
df.head(2)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.50,No

In [21]:
df.columns.unique()

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

In [29]:
df_sub = df[["customerID"]].copy()

df_sub["svc_1"] = np.where(df["OnlineSecurity"  ]=="Yes", 1, 0)
df_sub["svc_2"] = np.where(df["OnlineBackup"    ]=="Yes", 1, 0)
df_sub["svc_3"] = np.where(df["DeviceProtection"]=="Yes", 1, 0)
df_sub["svc_4"] = np.where(df["TechSupport"     ]=="Yes", 1, 0)
df_sub["svc_5"] = np.where(df["StreamingTV"     ]=="Yes", 1, 0)
df_sub["svc_6"] = np.where(df["StreamingMovies" ]=="Yes", 1, 0)

df_sub["count"] = df_sub["svc_1"] + df_sub["svc_2"] + df_sub["svc_3"] + df_sub["svc_4"] + df_sub["svc_5"] + df_sub["svc_6"]

df_sub.head(3)

   customerID  svc_1  svc_2  svc_3  svc_4  svc_5  svc_6  count
0  7590-VHVEG      0      1      0      0      0      0      1
1  5575-GNVDE      1      0      1      0      0      0      2
2  3668-QPYBK      1      1      0      0      0      0      2

In [35]:
chk2_1 = len(df_sub[df_sub["count"]==1])
chk2_2 = len(df_sub[df_sub["count"]==6])
chk2_1, chk2_2

(966, 284)

In [36]:
round(chk2_1/chk2_2, 2)

3.4

# Q2

In [37]:
df = pd.read_csv("galaxy_users.csv")
df.head(2)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.50,No

In [38]:
df.columns.unique()

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

In [40]:
df_sub = df[["customerID"]].copy()
df_sub.head(1)

   customerID
0  7590-VHVEG

In [48]:
df_sub["tenure"] = df["tenure"]
df_sub["MonthlyCharges"] = df["MonthlyCharges"]
df_sub["UseMonth"] = df["TotalCharges"]//df["MonthlyCharges"]
df_sub.head(2)

   customerID  tenure  MonthlyCharges  UseMonth
0  7590-VHVEG       1           29.85       1.0
1  5575-GNVDE      34           56.95      33.0

In [47]:
aaa = 7
bbb = 3

ccc = aaa/bbb   # 나눗셈
ddd = aaa//bbb  # 몫
eee = aaa%bbb   # 나머지
ccc,ddd,eee

(2.3333333333333335, 2, 1)

In [51]:
df_sub.corr(method="pearson")

                  tenure  MonthlyCharges  UseMonth
tenure          1.000000        0.246862  0.998831
MonthlyCharges  0.246862        1.000000  0.246164
UseMonth        0.998831        0.246164  1.000000

In [52]:
df_sub.corr(method="pearson").max()

tenure            1.0
MonthlyCharges    1.0
UseMonth          1.0
dtype: float64

# Q3

In [53]:
df = pd.read_csv("galaxy_users.csv")
df.head(2)

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.50,No

In [54]:
df.columns.unique()

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

In [57]:
df_x = df[['SeniorCitizen', 'Partner', 'Dependents','tenure','MonthlyCharges', 'TotalCharges','OnlineSecurity', 'OnlineBackup','DeviceProtection', 'TechSupport','StreamingMovies','PaperlessBilling']].copy()
df_y = df[['Churn']].copy()

In [60]:
df_x.head(3)

,SeniorCitizen,Partner,Dependents,tenure,MonthlyCharges,TotalCharges,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingMovies,PaperlessBilling
0,0,Yes,No,1,29.85,29.85,No,Yes,No,No,No,Yes
1,0,No,No,34,56.95,1889.50,Yes,No,Yes,No,No,No
2,0,No,No,2,53.85,108.15,Yes,Yes,No,No,No,Yes

In [61]:
len(df_x)

7032

In [ ]:
df_x["Partner"] = df_x["Partner"].apply(lambda x: 1 if x == 1 else )

In [59]:
from sklearn.model_selection import train_test_split

train_x, test_x, train_y, test_y = train_test_split(df_x, df_y, test_size = 0.3, random_state=123)

In [ ]:
from sklearn.preprocessing import MinMaxScaler

scaler_ = MinMaxScaler()

scaler_.fit(train_x)
train_x = scaler.transform(train_x)

scaler_.fit(test_x)
test_x = scaler.transform(test_x)

In [ ]:
from sklearn.linear_model import LogisticRegression

model = LogisticRegression()
model.fit (train_x, train_y)

In [ ]:
print(model.score(train_x, train_y))

In [ ]:
print(model.score(test_x, test_y)

In [ ]:
print(model.coef_)

# ==========================================

# Q1

# Q2

In [62]:
df_q2 = df[["tenure","MonthlyCharges","TotalCharges"]].copy()
df_q2.head(2)

   tenure  MonthlyCharges  TotalCharges
0       1           29.85         29.85
1      34           56.95       1889.50

In [63]:
df_q2["month"] = df_q2["TotalCharges"] // df_q2["MonthlyCharges"]
df_q2.head(2)

   tenure  MonthlyCharges  TotalCharges  month
0       1           29.85         29.85    1.0
1      34           56.95       1889.50   33.0

In [65]:
df_q2.drop(columns = "TotalCharges").corr().round(3)

                tenure  MonthlyCharges  month
tenure           1.000           0.247  0.999
MonthlyCharges   0.247           1.000  0.246
month            0.999           0.246  1.000

# Q3

In [68]:
col1 = ['SeniorCitizen', 'Partner', 'Dependents','tenure','MonthlyCharges', 'TotalCharges']
col2 = ['OnlineSecurity', 'OnlineBackup','DeviceProtection', 'TechSupport','StreamingMovies','PaperlessBilling']

In [69]:
df_q3 = df[['Churn'] + col1 + col2].copy()
df_q3

,Churn,SeniorCitizen,Partner,Dependents,tenure,MonthlyCharges,TotalCharges,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingMovies,PaperlessBilling
0,No,0,Yes,No,1,29.85,29.85,No,Yes,No,No,No,Yes
1,No,0,No,No,34,56.95,1889.50,Yes,No,Yes,No,No,No
2,Yes,0,No,No,2,53.85,108.15,Yes,Yes,No,No,No,Yes
3,No,0,No,No,45,42.30,1840.75,Yes,No,Yes,Yes,No,No
4,Yes,0,No,No,2,70.70,151.65,No,No,No,No,No,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
7027,No,0,Yes,Yes,24,84.80,1990.50,Yes,No,Yes,Yes,Yes,Yes
7028,No,0,Yes,Yes,72,103.20,7362.90,No,Yes,Yes,No,Yes,Yes
7029,No,0,Yes,Yes,11,29.60,346.45,Yes,No,No,No,No,Yes
7030,Yes,1,Yes,No,4,74.40,306.60,No,No,No,No,No,Yes
7031,No,0,No,No,66,105.65,6844.50,Yes,No,Yes,Yes,Yes,Yes

In [70]:
df_q3.dtypes

Churn                object
SeniorCitizen         int64
Partner              object
Dependents           object
tenure                int64
MonthlyCharges      float64
TotalCharges        float64
OnlineSecurity       object
OnlineBackup         object
DeviceProtection     object
TechSupport          object
StreamingMovies      object
PaperlessBilling     object
dtype: object

In [71]:
df_q3 = df_q3.replace({"Yes":1, "No":0})
df_q3.head(2)

,Churn,SeniorCitizen,Partner,Dependents,tenure,MonthlyCharges,TotalCharges,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingMovies,PaperlessBilling
0,0,0,1,0,1,29.85,29.85,0,1,0,0,0,1
1,0,0,0,0,34,56.95,1889.50,1,0,1,0,0,0

In [72]:
df_q3.dtypes   # 여전히 object 타입이 보인다

Churn                 int64
SeniorCitizen         int64
Partner               int64
Dependents            int64
tenure                int64
MonthlyCharges      float64
TotalCharges        float64
OnlineSecurity       object
OnlineBackup         object
DeviceProtection     object
TechSupport          object
StreamingMovies      object
PaperlessBilling      int64
dtype: object

In [74]:
df_q3_obj = df_q3.loc[:, df_q3.dtypes.astype("str").str.contains("obj")]
df_q3_obj.head(2)

  OnlineSecurity OnlineBackup DeviceProtection TechSupport StreamingMovies
0              0            1                0           0               0
1              1            0                1           0               0

In [75]:
df_q3_obj.apply(lambda x: x.unique())

,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingMovies
0,0,1,0,0,0
1,1,0,1,1,1
2,No internet service,No internet service,No internet service,No internet service,No internet service

In [76]:
df_q3 = df_q3.replace({"No internet service":-1})
df_q3.head(2)

,Churn,SeniorCitizen,Partner,Dependents,tenure,MonthlyCharges,TotalCharges,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingMovies,PaperlessBilling
0,0,0,1,0,1,29.85,29.85,0,1,0,0,0,1
1,0,0,0,0,34,56.95,1889.50,1,0,1,0,0,0

In [77]:
df_q3.dtypes

Churn                 int64
SeniorCitizen         int64
Partner               int64
Dependents            int64
tenure                int64
MonthlyCharges      float64
TotalCharges        float64
OnlineSecurity        int64
OnlineBackup          int64
DeviceProtection      int64
TechSupport           int64
StreamingMovies       int64
PaperlessBilling      int64
dtype: object

In [79]:
from sklearn.model_selection import train_test_split

df_train, df_test = train_test_split(df_q3, train_size = 0.7, random_state = 123)
len(df_train), len(df_test)

(4922, 2110)

In [81]:
from sklearn.preprocessing import MinMaxScaler

model_nor = MinMaxScaler().fit(df_train)
arr_train_nor = model_nor.transform(df_train)
arr_test_nor  = model_nor.transform(df_test)

In [82]:
arr_train_nor[:2,]

array([[1.        , 0.        , 0.        , 0.        , 0.08450704,
        0.81116094, 0.07551927, 0.5       , 1.        , 0.5       ,
        0.5       , 1.        , 1.        ],
       [1.        , 0.        , 1.        , 0.        , 0.        ,
        0.60737419, 0.00698708, 0.5       , 0.5       , 0.5       ,
        0.5       , 0.5       , 1.        ]])

In [83]:
from sklearn.linear_model import LogisticRegression

model_lr = LogisticRegression(random_state = 123)
model_lr.fit(X = arr_train_nor[:, 1:],
             y = arr_train_nor[:,  0])
pred = model_lr.predict(arr_test_nor[:, 1:])

In [84]:
pred[:3]

array([0., 0., 0.])

In [86]:
from sklearn.metrics import f1_score

round(f1_score(y_true = arr_test_nor[:, 0],
               y_pred = pred), 2)

0.55

# 기타 원소가 굉장히 많을 경우 일괄 변환 방법?

In [87]:
df = pd.read_csv("diamonds.csv")
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [90]:
df = df[['cut', 'color', 'clarity']].copy()
df.head(2)

       cut color clarity
0    Ideal     E     SI2
1  Premium     E     SI1

In [91]:
df.apply(lambda x: x.unique())

cut         [Ideal, Premium, Good, Very Good, Fair]
color                         [E, I, J, H, F, G, D]
clarity    [SI2, SI1, VS1, VS2, VVS2, VVS1, I1, IF]
dtype: object

In [95]:
ser_u = df.apply(lambda x: x.unique()).explode()
ser_u

cut            Ideal
cut          Premium
cut             Good
cut        Very Good
cut             Fair
color              E
color              I
color              J
color              H
color              F
color              G
color              D
clarity          SI2
clarity          SI1
clarity          VS1
clarity          VS2
clarity         VVS2
clarity         VVS1
clarity           I1
clarity           IF
dtype: object

In [96]:
np.where(ser_u.isin(["J","H"]), ser_u, -1)

array([-1, -1, -1, -1, -1, -1, -1, 'J', 'H', -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1], dtype=object)

In [98]:
ser_repl = pd.Series(np.where(ser_u.isin(["J","H"]), ser_u, -1),   index = ser_u)
ser_repl.head()

Ideal        -1
Premium      -1
Good         -1
Very Good    -1
Fair         -1
dtype: object

In [99]:
ser_repl.to_dict()

{'Ideal': -1,
 'Premium': -1,
 'Good': -1,
 'Very Good': -1,
 'Fair': -1,
 'E': -1,
 'I': -1,
 'J': 'J',
 'H': 'H',
 'F': -1,
 'G': -1,
 'D': -1,
 'SI2': -1,
 'SI1': -1,
 'VS1': -1,
 'VS2': -1,
 'VVS2': -1,
 'VVS1': -1,
 'I1': -1,
 'IF': -1}

In [100]:
df_repl = df.replace(ser_repl)
df_repl.head()

   cut color  clarity
0   -1    -1       -1
1   -1    -1       -1
2   -1    -1       -1
3   -1    -1       -1
4   -1     J       -1

In [101]:
df_repl.apply(lambda x: x.unique())

cut              [-1]
color      [-1, J, H]
clarity          [-1]
dtype: object

# 제거하고자 하는 원소가 여러 변수에 흩어져 있는 경우 해당 원소가 있는 행을 효과적으로 제거하는 방법?

In [102]:
df = pd.read_csv("galaxy_users.csv")
df_q1 = df.loc[:, "OnlineSecurity":"StreamingMovies"].copy()
df_q1.head(2)

,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies
0,No,Yes,No,No,No,No
1,Yes,No,Yes,No,No,No

In [106]:
print(len(df_q1))

7032

In [107]:
for col in df_q1.columns:
    print(col)
    df_q1 = df_q1.loc[df_q1[col] != "Yes", ]

OnlineSecurity
OnlineBackup
DeviceProtection
TechSupport
StreamingTV
StreamingMovies

In [108]:
print(len(df_q1))
df_q1.head(2)

2213

,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies
4,No,No,No,No,No,No
11,No internet service,No internet service,No internet service,No internet service,No internet service,No internet service

In [110]:
df = pd.read_csv("galaxy_users.csv")
df_q1 = df.loc[:, "OnlineSecurity":"StreamingMovies"].copy()

In [111]:
len(df_q1)

7032

In [112]:
df_q1 = df_q1.replace({"Yes": np.nan})
df_q1.head(2)

,OnlineSecurity,OnlineBackup,DeviceProtection,TechSupport,StreamingTV,StreamingMovies
0,No,NaN,No,No,No,No
1,NaN,No,NaN,No,No,No

In [113]:
len(df_q2)

4301